# Pandas (Python for data analysis)

    Based on Numpy Library

In [3]:
import pandas as pd

In [4]:
a = pd.Series(1)

In [5]:
a

0    1
dtype: int64

In [6]:
b = pd.Series([1,2.2,"3",True],index = [11,22,33,44])
b

11       1
22     2.2
33       3
44    True
dtype: object

In [7]:
df = {'DAYS': ["Monday", "Tuesday", "Wednesday"]}

In [8]:
df = pd.DataFrame(df)

In [9]:
df

        DAYS
0     Monday
1    Tuesday
2  Wednesday

# Pandas Datatypes

In [10]:
# list to array
# array to series
# series to dataframe

In [11]:
# list to array
import numpy as np
kc = ["Kaustubh", "Akhilesh", "Chaubey", "23-07-2001"]

In [12]:
into_array = np.array(kc)

In [13]:
into_array

array(['Kaustubh', 'Akhilesh', 'Chaubey', '23-07-2001'], dtype='<U10')

In [14]:
# array to series
into_series = pd.Series(into_array)

In [15]:
into_series

0      Kaustubh
1      Akhilesh
2       Chaubey
3    23-07-2001
dtype: object

In [16]:
#series to dataframe
df = pd.DataFrame(into_series)

In [17]:
df

            0
0    Kaustubh
1    Akhilesh
2     Chaubey
3  23-07-2001

In [18]:
ck = pd.DataFrame({"Name":['Kaustubh','Ismail','Sakshi','Swara']})

In [19]:
ck

       Name
0  Kaustubh
1    Ismail
2    Sakshi
3     Swara

In [20]:
ck['Surname'] = ['Chaubey','Sakerde','Kalambe','Sawant']
ck['Age']=[22,22,20,21]

In [21]:
ck

       Name  Surname  Age
0  Kaustubh  Chaubey   22
1    Ismail  Sakerde   22
2    Sakshi  Kalambe   20
3     Swara   Sawant   21

In [22]:
ck['Marks']=[92.3,94.5,93.4,95.6]

In [23]:
ck

       Name  Surname  Age  Marks
0  Kaustubh  Chaubey   22   92.3
1    Ismail  Sakerde   22   94.5
2    Sakshi  Kalambe   20   93.4
3     Swara   Sawant   21   95.6

In [24]:
del ck['Marks']

In [25]:
ck

       Name  Surname  Age
0  Kaustubh  Chaubey   22
1    Ismail  Sakerde   22
2    Sakshi  Kalambe   20
3     Swara   Sawant   21

In [26]:
df1 = pd.read_csv("diabetes (1).csv")

In [27]:
df1

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,500,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,102,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [28]:
df1.head(5)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,500,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,102,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [29]:
df1.tail(5)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [30]:
df1.shape

(768, 9)

In [31]:
df1.columns

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

In [32]:
df1.describe

<bound method NDFrame.describe of      Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin   BMI  \
0              6      148            500             35        0  33.6
1              1       85             66             29        0  26.6
2              8      183             64              0        0  23.3
3              1       89             66             23       94  28.1
4              0      137             40             35      168  43.1
..           ...      ...            ...            ...      ...   ...
763           10      101             76             48      180  32.9
764            2      122             70             27        0  36.8
765            5      121             72             23      112  26.2
766            1      126             60              0        0  30.1
767            1       93             70             31        0  30.4

     DiabetesPedigreeFunction  Age  Outcome
0                       0.627   50        1
1                       0.351   31        0
2                       0.672  102        1
3                       0.167   21        0
4                       2.288   33        1
..                        ...  ...      ...
763                     0.171   63        0
764                     0.340   27        0
765                     0.245   30        0
766                     0.349   47        1
767                     0.315   23        0

[768 rows x 9 columns]>

In [33]:
df1.describe()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,122.242188,69.662760,20.536458,79.799479,31.992578,0.471876,33.308594,0.348958
std,3.369578,49.001676,24.827374,15.952218,115.244002,7.884160,0.331329,11.998145,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,141.000000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,1150.000000,500.000000,99.000000,846.000000,67.100000,2.420000,102.000000,1.000000

In [34]:
df1.info

<bound method DataFrame.info of      Pregnancies  Glucose  BloodPressure  SkinThickness  Insulin   BMI  \
0              6      148            500             35        0  33.6
1              1       85             66             29        0  26.6
2              8      183             64              0        0  23.3
3              1       89             66             23       94  28.1
4              0      137             40             35      168  43.1
..           ...      ...            ...            ...      ...   ...
763           10      101             76             48      180  32.9
764            2      122             70             27        0  36.8
765            5      121             72             23      112  26.2
766            1      126             60              0        0  30.1
767            1       93             70             31        0  30.4

     DiabetesPedigreeFunction  Age  Outcome
0                       0.627   50        1
1                       0.351   31        0
2                       0.672  102        1
3                       0.167   21        0
4                       2.288   33        1
..                        ...  ...      ...
763                     0.171   63        0
764                     0.340   27        0
765                     0.245   30        0
766                     0.349   47        1
767                     0.315   23        0

[768 rows x 9 columns]>

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [36]:
df1['BloodPressure'].value_counts()

70     57
74     52
78     45
68     45
64     43
72     43
80     40
76     39
60     37
0      35
62     34
66     30
82     30
88     25
84     23
90     22
86     21
58     21
50     13
56     12
54     11
52     11
75      8
92      8
65      7
94      6
85      6
48      5
96      4
44      4
98      3
110     3
100     3
106     3
108     2
55      2
30      2
104     2
46      2
38      1
24      1
61      1
500     1
102     1
95      1
122     1
40      1
114     1
Name: BloodPressure, dtype: int64

In [37]:
df1['Pregnancies'].nunique()

17

In [38]:
import seaborn as sns

In [42]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [50]:
df2 = sns.load_dataset("titanic")

In [51]:
df2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [54]:
len(df2.query("pclass==3 and survived == 0"))

372

In [55]:
len(df2.query("pclass==2 and survived == 0"))

97

In [57]:
len(df2.query("pclass==1 and survived == 0"))

80

In [60]:
len(df2.query("sex == 'male' and survived == 1"))

109

In [61]:
len(df2.query("sex == 'female' and survived == 1"))

233

In [67]:
len(df2.query("survived == 1 and alone == 'True'"))

0

In [70]:
# AGE GROUP WISE PERON SURVIVED

# fare and survived

# p1 -- > fare
# p2 -- > fare
# p3 --> fare

# ( pclass 1 with male // pclass 3 with female ) --> survived

In [73]:
len(df2.query("age >0 and age < 10 "))

62

In [74]:
len(df2.query("age > 10 and age < 20 "))

100

In [75]:
len(df2.query("age > 20 and age < 30 "))

205

In [76]:
len(df2.query("age > 30 and age < 40 "))

142

In [77]:
len(df2.query("age > 50 and age < 60 "))

38

In [78]:
len(df2.query("age > 20 and age < 25 "))

99

In [79]:
len(df2.query("age > 25 and age < 30 "))

83

In [87]:
len(df2.query("age==24"))

30

In [86]:
# highest death age 24 --> 30 deaths

In [97]:
df2['fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [101]:
len(df2.query("pclass == 1 and fare < 32 "))

57

In [102]:
len(df2.query("pclass == 1 and fare > 32 "))

159

In [103]:
len(df2.query("pclass == 2 and fare < 32 "))

162

In [104]:
len(df2.query("pclass == 2 and fare > 32 "))

22

In [118]:
len(df2.query("pclass == 3 and fare < 20 "))

324

In [119]:
# class 3 pasenger of class 3 have paid fare less than 20 dollars

In [107]:
len(df2.query("pclass == 3 and fare > 32 "))

30

In [108]:
len(df2.query("survived ==1 and fare < 32 "))

216

In [109]:
len(df2.query("survived ==1 and fare > 32 "))

126

In [123]:
len(df2.query("survived ==1 and fare > 70 "))

76

In [120]:
# person survived have paid fare range arround 40 dollar

In [125]:
len(df2.query("survived ==1 and fare < 10 "))

67